# NewCurveArrArray Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewCurveArrArray Method
Application Class See Also
---
Creates an empty array that can store geometric curve loops.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArrArray NewCurveArrArray()
```

Visual Basic
---
```text
Public Function NewCurveArrArray As CurveArrArray
```

Visual C++
---
```text
public:
CurveArrArray^ NewCurveArrArray()
```

# ### Return Value
The empty array of curve loops.
# See Also
Application Class
Autodesk.Revit.Creation Namespace